УТ.ФБ_КоннекторШины/src/InformationRegisters/ш_ОчередьПакетовВШину/ш_ОчередьПакетовВШину.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ш_ОчередьПакетовВШину</name>
  <resources>
    <name>Пакет</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОчереди</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СистемаНазначения</name>
    <type>
      <types>CatalogRef.ш_Системы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПакета</name>
    <type>
      <types>EnumRef.ш_ВидыПакетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.ш_ТипыСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.ФБ_КоннекторШины/src/InformationRegisters/ш_ОчередьПакетовВШину/ManagerModule.bsl
Функция ПолучитьСтруктуруПакетаДляДальнейшейОтправки() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("СистемаНазначения");
	Результат.Вставить("ВидПакета");
	Результат.Вставить("ТипСообщения");
	Результат.Вставить("Пакет");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьПакетДляОтправки(Данные) Экспорт
	
	МассивПакетов=Новый Массив;
	Если ТипЗнч(Данные)=Тип("Массив") Тогда
		МассивПакетов=Данные;
	Иначе
		МассивПакетов.Добавить(Данные);
	КонецЕсли;
	
	Для каждого стрПакет Из МассивПакетов Цикл
	
		ИДПакета=СокрЛП(Новый УникальныйИдентификатор);
		рег=РегистрыСведений.ш_ОчередьПакетовВШину.СоздатьНаборЗаписей();
		рег.Отбор.ИД.Установить(ИДПакета,Истина);
		
		стрРег=рег.Добавить();
		ЗаполнитьЗначенияСвойств(стрРег,стрПакет);
		стрРег.ИД=ИДпакета;
		стрРег.ДатаОчереди=ТекущаяДатаСеанса();
		
		рег.ОбменДанными.Загрузка=Истина;
		рег.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры
